app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("description", "complete", "important", "urgent", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["description", "This is my first task"], ["complete", false], ["important", true], ["urgent", true], ["created_at", "2022-01-28 02:37:16.259603"], ["updated_at", "2022-01-28 02:37:16.259603"]]

  def update
    respond_to do |format|
      if @task.update(task_params)
---
UPDATE "tasks" SET "description" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["description", "Important and Urgent"], ["updated_at", "2022-01-28 03:10:11.518098"], ["id", 2]]